<h3>Pandas-DataFrame And Series</h3>

Pandas is a powerful data manipulation library in Python, widely used for data analysis and data cleaning. It provides two primary data structures: Series and DataFrame. A Series is a one-dimensional array-like object, while a DataFrame is a two-dimensional, size-mutable, and potentially heterogeneous tabular data structure with labeled axes (rows and columns).

In [4]:
import pandas as pd

In [7]:
# Series
## A Pandas Series is a one-dimensional array-like object that can hold any data type . It is similar to a column in a table. 

import pandas as pd
data=[1,2,3,4,5]
series = pd.Series(data)
print(series)
print(type(series))

0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [8]:
## create a Series from Dictionary
data = {'a':1,'b':2,'c':3}
series_dict = pd.Series(data)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [14]:
data = [10,20,30]
index = ['a','b','c']
pd.Series(data,index=index)

a    10
b    20
c    30
dtype: int64

In [16]:
## Dataframe
## create a Dataframe from a dictionary of list
data = {
    'Name':['Krish','John','Jack'],
    'Age':[25,30,45],
    'City':['Bangalore','New York','Texas']
}
df = pd.DataFrame(data)
print(df)
print(type(df))

    Name  Age       City
0  Krish   25  Bangalore
1   John   30   New York
2   Jack   45      Texas
<class 'pandas.core.frame.DataFrame'>

In [17]:
import numpy as np
np.array(df)

array([['Krish', 25, 'Bangalore'],
       ['John', 30, 'New York'],
       ['Jack', 45, 'Texas']], dtype=object)

In [19]:
##create a Data frame From a list of Doctionaries

data =[
    {'Name':'Jack','Age':32,'City':"Mangalore"},
    {'Name':'John','Age':33,'City':"Bangalore"},
    {'Name':'Jack','Age':35,'City':"Mangalore"},
    {'Name':'Krishna','Age':36,'City':"Mangalore"},
    {'Name':'Karan','Age':31,'City':"Mangalore"},
]

df = pd.DataFrame(data)
print(df)
print(type(df))

      Name  Age       City
0     Jack   32  Mangalore
1     John   33  Bangalore
2     Jack   35  Mangalore
3  Krishna   36  Mangalore
4    Karan   31  Mangalore
<class 'pandas.core.frame.DataFrame'>

In [23]:
df.to_csv('sales.csv',index=False)

In [27]:
daf = pd.read_csv('sales.csv')

print(daf.head(5))

      Name  Age       City
0     Jack   32  Mangalore
1     John   33  Bangalore
2     Jack   35  Mangalore
3  Krishna   36  Mangalore
4    Karan   31  Mangalore

In [30]:
type(df['Name'])

pandas.core.series.Series

In [31]:
df['Name']

0       Jack
1       John
2       Jack
3    Krishna
4      Karan
Name: Name, dtype: object

In [41]:
df.loc[1][2]

C:\Users\ASUS\AppData\Local\Temp\ipykernel_19492\3163812330.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.loc[1][2]

'Bangalore'

In [42]:
df.iloc[1][2]

C:\Users\ASUS\AppData\Local\Temp\ipykernel_19492\65333983.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[1][2]

'Bangalore'

In [43]:
## Accessing data from dataframe
df

      Name  Age       City
0     Jack   32  Mangalore
1     John   33  Bangalore
2     Jack   35  Mangalore
3  Krishna   36  Mangalore
4    Karan   31  Mangalore

In [44]:
df['Name']

0       Jack
1       John
2       Jack
3    Krishna
4      Karan
Name: Name, dtype: object

In [46]:
type(df['Name'])

pandas.core.series.Series

In [51]:
df.loc[4]  # row index

Name        Karan
Age            31
City    Mangalore
Name: 4, dtype: object

In [52]:
df.iloc[4] # index(coloumn) location

Name        Karan
Age            31
City    Mangalore
Name: 4, dtype: object

In [57]:
## Acessing specified element
df.at[4,'Age']

np.int64(31)

In [56]:
df

      Name  Age       City
0     Jack   32  Mangalore
1     John   33  Bangalore
2     Jack   35  Mangalore
3  Krishna   36  Mangalore
4    Karan   31  Mangalore

In [59]:
df.at[3,'Name']

'Krishna'

In [62]:
# Accesing a specified element using iat
df.iat[1,2]

'Bangalore'

In [63]:
df

      Name  Age       City
0     Jack   32  Mangalore
1     John   33  Bangalore
2     Jack   35  Mangalore
3  Krishna   36  Mangalore
4    Karan   31  Mangalore

In [67]:
### Data Manipulation with Dataframe
## Adding a column
df['Salary']=[50000,40000,50000,70000,60000]

In [68]:
df

      Name  Age       City  Salary
0     Jack   32  Mangalore   50000
1     John   33  Bangalore   40000
2     Jack   35  Mangalore   50000
3  Krishna   36  Mangalore   70000
4    Karan   31  Mangalore   60000

In [71]:
#remove a Column
df.drop('Salary',axis=1)  # temporarily

      Name  Age       City
0     Jack   32  Mangalore
1     John   33  Bangalore
2     Jack   35  Mangalore
3  Krishna   36  Mangalore
4    Karan   31  Mangalore

In [72]:
df

      Name  Age       City  Salary
0     Jack   32  Mangalore   50000
1     John   33  Bangalore   40000
2     Jack   35  Mangalore   50000
3  Krishna   36  Mangalore   70000
4    Karan   31  Mangalore   60000

In [73]:
# removing column permanentaly
df.drop('Salary',axis=1,inplace=True)

In [74]:
df

      Name  Age       City
0     Jack   32  Mangalore
1     John   33  Bangalore
2     Jack   35  Mangalore
3  Krishna   36  Mangalore
4    Karan   31  Mangalore

In [75]:
## Add age to the column
df['Age']=df['Age']+1
df

      Name  Age       City
0     Jack   33  Mangalore
1     John   34  Bangalore
2     Jack   36  Mangalore
3  Krishna   37  Mangalore
4    Karan   32  Mangalore

In [76]:
df.drop(0) # row deleting temporarily

      Name  Age       City
1     John   34  Bangalore
2     Jack   36  Mangalore
3  Krishna   37  Mangalore
4    Karan   32  Mangalore

In [77]:
df

      Name  Age       City
0     Jack   33  Mangalore
1     John   34  Bangalore
2     Jack   36  Mangalore
3  Krishna   37  Mangalore
4    Karan   32  Mangalore

In [78]:
df.drop(0,inplace=True)

In [79]:
df

      Name  Age       City
1     John   34  Bangalore
2     Jack   36  Mangalore
3  Krishna   37  Mangalore
4    Karan   32  Mangalore

In [80]:
df=pd.read_csv('sales.csv')
df.head(5)

      Name  Age       City
0     Jack   32  Mangalore
1     John   33  Bangalore
2     Jack   35  Mangalore
3  Krishna   36  Mangalore
4    Karan   31  Mangalore

In [81]:
# data types
df.dtypes

Name    object
Age      int64
City    object
dtype: object

In [83]:
# Describe the dataframe
df.describe()

             Age
count   5.000000
mean   33.400000
std     2.073644
min    31.000000
25%    32.000000
50%    33.000000
75%    35.000000
max    36.000000